app/controllers/api/v1/contacts_controller.rb

    def index
        contacts = Contact.all
---
SELECT "contacts".* FROM "contacts"

    def create
        @contact = Contact.create!(contact_params)
---
INSERT INTO "contacts" ("first_name", "last_name", "email", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"